# PART 3. DISPLAYING DATA

## 1. Using the Pandas library

In [2]:
import pandas as pd
import sqlite3

conn = sqlite3.connect("../databases/flights.db")
df = pd.read_sql_query("select id, name from airlines limit 5;", conn)
df

  id                                          name
0  1                                Private flight
1  2                                   135 Airways
2  3                                 1Time Airline
3  4  2 Sqn No 1 Elementary Flying Training School
4  5                               213 Flight Unit